---
kind: other
id: Methods.T:Autodesk.Revit.DB.WorksharingUtils
source: html/205fa377-e6ad-aef0-e783-35b50152c336.htm
---
# WorksharingUtils Methods

Obtains ownership for the current user of as many specified elements as possible.